Revit 2026 API

# AnalysisDisplayDiagramSettingsOutlineColor Property

---

Color of outline and fence lines in the diagram.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color OutlineColor { get; set; }
```
```vb
Public Property OutlineColor As Color
	Get
	Set
```
```cpp
public:
property Color^ OutlineColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member OutlineColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

AnalysisDisplayDiagramSettings Class

Autodesk.Revit.DB.Analysis Namespace